brew "bat"
brew "fzf"
brew "ripgrep"
brew "nvim"
brew "tmux"
brew "pyenv"
brew "nvm"
brew "aria2"
brew "zoxide"
brew "eza"
brew "jq"
brew "git"
brew "gh"
brew "opencode" 
brew "pyright"
brew "jdtls"
brew "bash-language-server"
cask "mactex"
cask "ghostty"
